main.jsf=G\u0142\u00f3wna
lang.jsf = J\u0119zyk
navi.jsf= Nawigacja
myInfo.jsf=O mnie
marekHoraczyInfo.jsf=Strona informacyjna Marka Horaczego
start.jsf=Cze\u015b\u0107! <br /> \nNazywam si\u0119 Marek Horaczy. Z zami\u0142ownia  jestem  programist\u0105 javy  kt\u00f3ry tworzy t\u0105 strone aby na\u015bwietli\u0107 moj\u0105 posta\u0107 potencjalnemu nowemu pracodawcy. <br />\nZ technicznego punktu widzenia strona ta zbudowana jest poprzez framework Java Server Faces wraz z nak\u0142\u0105dk\u0105 graficzn\u0105 Prime Faces.  Ca\u0142o\u015b\u0107 jest wystawiona  poprzez hosting zapewniony przez https://www.openshift.com. <br />\nZapraszam do przegl\u0105dniecia szczeg\u00f3\u0142owych informacji o mnie, kr\u00f3tkich opis\u00f3w projekt\u00f3w w kt\u00f3rych pracowa\u0142em/pracuje czy pozosta\u0142ych aplikacji kt\u00f3re r\u00f3wnie\u017c tworze w wolnym czasie. 
startH.jsf=O stronie
uzH.jsf=Uniwersytet Zielonog\u00f3rski
uzInfo1.jsf=Studia wy\u017csze uko\u0144czy\u0142em na wydziale matematyki informatyki i ekonometrii w Zielonej G\u00f3rze.<br/>
uzInfo2.jsf=Czas studi\u00f3w mo\u017cna by by\u0142o stre\u015bci\u0107 jedn\u0105 z moich starych notatek.<br/>
uzInfo3.jsf=Mimo \u017ce wi\u0119kszo\u015b\u0107 przedmiot\u00f3w by\u0142a powi\u0105zana bezpo\u015brednio z matematyka oraz przedmiotami z niej opartymi, pojawi\u0142o si\u0119 pare przedmiot\u00f3w zwi\u0105zanych z programowaniem i bazami danych. Mimo \u017ce nie by\u0142o ich wiele, zaszepi\u0142y we mnie fascynacj\u0119 programowania kt\u00f3r\u0105 ju\u017c sam z determinacj\u0105 stara\u0142em si\u0119 rozwija\u0107.
work1.jsf=Po uko\u0144czeniu studi\u00f3w uda\u0142o mi si\u0119 dosta\u0107 na praktyki do lokalnej firmy Max Elektronik w kt\u00f3rej zreszt\u0105 pracuje do dzi\u015b. Trafi\u0142em do zespo\u0142u specjalist\u00f3w w kt\u00f3rym otrzymywa\u0142em przez pierwsze 3 misi\u0105ce r\u00f3\u017cne zadania zwi\u0105zane \u015bci\u015ble z je\u017ceykiem java. Zaczynaj\u0105c od test\u00f3w jednostkowych metod po stronie serwera za pomoc\u0105 JUNIT przez przepisywanie cz\u0119\u015b\u0107 starszego projektu z j\u0119zyka c++ na jave dochodz\u0105\u0107 do samodzielnego pisania serwis\u00f3w w springu kt\u00f3re te\u017c p\u00f3\u017aniej testowa\u0142em poprzez aplikacje SOAPUI. Szef widz\u0105c moje zaanga\u017cowanie postanowi\u0142 przydzieli\u0107 mnie do 'zespo\u0142u ratunkowego' kt\u00f3ry mia\u0142 wesprze\u0107 projekt koleg\u00f3w z Warszawy, oparty na smartGWT, hibernate oraz springu. W nim sp\u0119dzi\u0142em bardzo owocny rok, programuj\u0105c.
workH.jsf=Pocz\u0105tek pracy oraz Java w Max Elektronik
sasH.jsf=Nowy projekt, platforma SAS oraz hurtownie danych
sas1.jsf=Po udanej "akcji ratunkowej" projektu POBYT, zosta\u0142\u0119m przyj\u0119ty do firmy na sta\u0142e.Otrzyma\u0142em umowe na czas nieokre\u015blony oraz status  pe\u0142noprawnego pracownika. Z\u0142o\u017cy\u0142o si\u0119 tak \u017ce by\u0142 chwilowy zast\u00f3j w\u015br\u00f3d projekt\u00f3w javy a nowo otwarta kom\u00f3rka hurtowni danych potrzebowa\u0142a \u015bwierzych os\u00f3b do jednego z wi\u0119kszych projekt\u00f3w jakie nasze firma mia\u0142a okazje robi\u0107. W ten spos\u00f3b trafi\u0142em do projektu opartego na platformie SAS. Do kt\u00f3rej nale\u017ce i w kt\u00f3rej pracuj\u0119 w do tej chwili.
projectsH.jsf=Projekty
plid1.jsf=PL.ID jest projektem zwi\u0105zanym z nowymi  elektronicznymi dowodami osobistymi oraz  modernizacj\u0105 istniej\u0105cego rejestru PESEL.\nWi\u0119cej informacji na temat systemu mo\u017cna znale\u017a\u0107 pod adresem:</br>\n<a href="http://obywatel.gov.pl/prezentacja-urzednik">Rz\u0105dowa strona informacyjna projektu PL.ID</a>\n\n
plid2.jsf=W ramach tego projektu przepracowa\u0142em oko\u0142o 2 miesi\u0105ce.  Dostawa\u0142em wiele pomniejszych zada\u0144 aby zaaklimatyzowa\u0107 si\u0119 w firmie. W sk\u0142ad pierwszych zada\u0144 kt\u00f3re mi przydzialony wchodzi\u0142y:\n<ul>\n<li>\nPokrywanie tesetami jednostkowymi metod w klasach stworzonych przez moich starszych koleg\u00f3w. U\u017cywa\u0142em do tego pluginu w eclipse aby wyszuka\u0107 obszar\u00f3w kt\u00f3re by\u0142y nie przetestowane, oraz tworzy\u0142em do nich metody testuj\u0105ce na bazie frameworku JUNIT. \n</li>\n<li>\nTestowanie webservic\u00f3w poprzez tworzenie zgodnie ze standardami projektu xmli zawierj\u0105ce wywo\u0142anie us\u0142ugi z r\u00f3\u017cnymi parametrami. Do tego rodzaju test\u00f3w u\u017cywa\u0142em aplikacji SOAPUI\n</li>\n<li>\nPo wdro\u017ceniu sie poprzez testy otrzymywa\u0142em kolejne zadania, dochodz\u0105c do momentu w kt\u00f3rym sam zgodnie z odpowiednimi standardami,schematami oraz dokumentacj\u0105 implementowa\u0142em springowe serwisy. Jednym z nich np by\u0142a us\u0142uga kt\u00f3ra umieszcza\u0142a w rejestrze informacje na temat nowo narodzonego cz\u0142onka naszgeo spo\u0142ecze\u0144stwa.  Z technicznego punktu widzenia by\u0142o to metody w springowych beanach oznaczone odpowiednimi adnotacjami a p\u00f3\u017aniej wystawione jako webservcie do kt\u00f3rych odwo\u0142ywa\u0142y si\u0119 aplikacje zewn\u0119trzne.\n</li>\n<li>\nPonadto mia\u0142em te\u017c przyjemno\u015b\u0107 przepisywa\u0107 cze\u015b\u0107 starego  Systemu Zarz\u0105dzania Baz\u0105 Danych JANTAR opartym na j\u0119zyku C++ na j\u0119zyk java, kt\u00f3ry dalej mia\u0142 by\u0107 u\u017cytywany poprzez nasze aplikacje wewn\u0119trzne. \n</li>\n<ul>
pobyt1.jsf=System Pobyt \u2013 jest krajowym zbiorem rejestr\u00f3w, ewidencji i wykazu w sprawach cudzoziemc\u00f3w.  Projekt tworzony dla Urz\u0105du do Spraw Cudzoziemc\u00f3w kt\u00f3ry umo\u017cliwia wprowadzanie wniosk\u00f3w,decyzji,rozstrzygni\u0119\u0107 w sprawie mi\u0119dzy innymi przyznania wizy ,wydalenia cudzoziemca czy np nadania obywatelstwa. Ponadto system jest po\u0142\u0105czony po\u015brednio  z "Visa Information System"  czy "Schengen Information System" z kt\u00f3rymi wymienia dane na temat cudzoziemc\u00f3w. Do  stworzenia tego systemu zosta\u0142y u\u017cyte takie technologie jak: smartGWT(strona klienta),spring oraz hibernate  (po stronie serwera) 
pobyt2.jsf=By\u0142 to m\u00f3j pierwszy du\u017cy i profesionalny projekt w kt\u00f3rym mia\u0142em szanse wykaza\u0107 si\u0119 jako developer. Razem ze starszymi i do\u015bwiadczonymi kolegami zosta\u0142 przydzielony jako pomoc ratunkowa. Projekt by\u0142 w bardzo wczesnym stadium a termin oddania by\u0142 ju\u017c bardzo blisko. Na pocz\u0105tku by\u0142em pomocnikiem dla swoich starszych koleg\u00f3w, lecz po paru miesi\u0105cach pracy  by\u0142 ju\u017c niezale\u017cnym programist\u0105 kt\u00f3ry by\u0142 pe\u0142noprawnym cz\u0142onkiem zespo\u0142u.\n\nMoimi g\u0142\u00f3wnymi obowi\u0105zkami w projekcie by\u0142y:</br>\n<ul>\n<li>\nTworzenie g\u0142\u00f3wnych formularzy oraz widok\u00f3w aplikacji.</br>\nNa pocz\u0105tku pracy w projekcie otrzymywa\u0142em dokumentacje zwi\u0105zan\u0105 z konkretnym ekranem, jego wygl\u0105dem i z\u0142o\u017cono\u015bci\u0105 okre\u015blon\u0105 przez analiz\u0119 w porozumieniu z klientem. \nTak wi\u0119c stara\u0142em si\u0119 na odtworzy\u0107 widok aplikacji wed\u0142ug opisu. Baz\u0105 moich dzia\u0142a\u0144 by\u0142a szeroka <a href="http://www.smartclient.com/smartgwt/showcase/#main"> biblioteka</a> komponent\u00f3w frameworka smartGWT. \nWyszukiwa\u0142em odpowiednich komponent\u00f3w, layout\u00f3w, \u0142\u0105czy\u0142em je w grupy b\u0105d\u017a modyfikowa\u0142em i nagina\u0142em do tego stopnia aby wpasowa\u0142y si\u0119 w wizj\u0119 interfejsu u\u017cytkownika.\n</li></br>\n<li>\nTworzenie mechanizm\u00f3w kontrolera do obs\u0142ugi zdarze\u0144 i przesy\u0142ania danych.</br> \nPo przygotowaniu tak zwanych "makiet" ekran\u00f3w, czyli nieoprogramowanego interfejsu u\u017cytkownika by\u0142em dalej odpowiedzialny za implementacje oczekuj\u0105cego dzia\u0142ania, wskazanego w dokumentacji.</br>\nG\u0142ownym mechanizmem od kt\u00f3rego zaczyna\u0142a si\u0119 kontrola przep\u0142ywu by\u0142 tak zwany "values menager". By\u0142a to klasa oraz mechanizmy z ni\u0105 zwi\u0105zane do zarz\u0105dzania danymi na wielu formularzach oraz przesy\u0142ania informacji do cz\u0119\u015bci serwerowej aplikacji. \nPo przetworzeniu przez pierwsze mechnizmy smartGWT dane trafia\u0142y do wskazanych bean\u00f3w springowych kt\u00f3re dalej przetwarza\u0142y dane po stronie serwera.\nW nich dzia\u0142 si\u0119 ca\u0142y biznes kt\u00f3ry by\u0142 ewentualnie powi\u0105zany z frameworkiem hibernate i dalszym przetwarzaniem danych po stronie bazy danych.\nAplikacja dzia\u0142aj\u0105ca w ten spos\u00f3b opiera\u0142a si\u0119 wzorcu Model View Controller.\n</li></br>\n<li>\nWprowadzanie nowego developera do pracy w zespole i w strukturach projektu.</br> \nW ostatnich miesi\u0105cach projektu kierownik przydzieli\u0142 mi nowego pracownika kt\u00f3rego wprowadza\u0142em w arkana mechanizm\u00f3w i struktur istniej\u0105cego projektu. By\u0142em odpowiedzialny za jego wdro\u017cenie.\nTworzy\u0142em zadania oraz weryfikowa\u0142em ich wynik. Og\u00f3lnie rzecz bior\u0105c otrzyma\u0142em pomocnika na kt\u00f3rego mog\u0142em zrzuci\u0107 \u0142atwe tematy wymagaj\u0105ce czasem sporego nak\u0142adu czasu a samemu zaj\u0105\u0107 si\u0119 bardziej wymagaj\u0105cymi.</br>\nOczywi\u015bcie by\u0142em r\u00f3wnie\u017c odpowiedzialny za jego kod.</br>\n</li></br>\n\n</ul>\n
p11.jsf=G\u0142\u00f3wnym celem projektu \u201eElektroniczna Platforma Gromadzenia, Analizy i Udost\u0119pniania Zasob\u00f3w Cyfrowych o Zdarzeniach Medycznych\u201d \n(P1) jest budowa elektronicznej platformy us\u0142ug publicznych w zakresie ochrony zdrowia, kt\u00f3ra umo\u017cliwi organom administracji\n publicznej i obywatelom gromadzenie, analiz\u0119 i udost\u0119pnianie zasob\u00f3w cyfrowych o zdarzeniach medycznych w zakresie zgodnym\n z ustaw\u0105 z dnia 28 kwietnia 2011 r. o systemie informacji w ochronie zdrowia. W systemie P1 b\u0119d\u0105 si\u0119 znajdowa\u0142y informacje\n o zdarzeniach medycznych wszystkich obywateli Polski \u2013 niezale\u017cnie od p\u0142atnika oraz obywateli Unii Europejskiej i innych kraj\u00f3w\n, kt\u00f3rzy skorzystaj\u0105 ze \u015bwiadcze\u0144 zdrowotnych w Polsce.\nIstnieje nawet reklama projektu<a href="https://www.youtube.com/watch?v=PfA_aVPjobg">wystawiona przez pa\u0144stwo</a>\n\n<ul>\nJest to bardzo du\u017cy projekt w kt\u00f3rym mo\u017cna wyr\u00f3\u017cni\u0107 wiele modu\u0142\u00f3w. \nM\u00f3j zesp\u00f3\u0142 odpowiada za stworzenie systemu raportuj\u0105cego kt\u00f3ry bazuj\u0119 na bardzo du\u017cej ilo\u015bci danych.\nU\u017cywamy do tego znanej w hurtowni danych platformy SAS.\nZaczynaj\u0105cy od pocz\u0105tku, moj\u0105 cz\u0119\u015bcia jako developera by\u0142y nast\u0119puj\u0105ce rzeczy:</br>\n\n<li>\nWykonanie projektu wykonawczego u\u017cywaj\u0105c j\u0119zyka UML. Projekt wykonawczy jest zwi\u0105zana z tym \u017ce\nna pocz\u0105tku projektu(jak i po cz\u0119\u015bci w jego trakcie) nie posiadamy bazy danych na kt\u00f3rej mo\u017cemy oprze\u0107 hurtowanie.\nNa nas i po cz\u0119\u015bci na zesp\u00f3\u0142 analizy spad\u0142a odpowiedzialno\u015b\u0107 stworzenia struktur s\u0142ownik\u00f3w,fakt\u00f3w,datagram\u00f3w\nna bazie dost\u0119pnych informacji i dokumentacji od klienta.\n</li></br>\n\n<li>\nPo stworzeniu projektu wykonawczego zacz\u0119li\u015bmy szkoli\u0107 si\u0119 w zakresie platformy SAS\noraz przygotowywa\u0107 odpowiednie \u015brodowisko developerskie na kt\u00f3rym instalowali\u015bmy cz\u0119\u015bci platformy.\n</li></br>\n\n<li>\nKolejnym i najwa\u017cniejszym etapem by\u0142a ju\u017c w\u0142a\u015bciwa praca na narz\u0119dziach SAS do kt\u00f3rych moge zaliczy\u0107:</br></br>\n\n<ul>\n\n<li>\n<b>SAS Data Integration</b>  Do tworzenia bibliotek sasowych oraz zarz\u0105dzania nimi oraz tabelami danych.\n</li></br>\n\n<li>\n<b>SAS Management Console</b> U\u017cywany g\u00f3wnie do zarz\u0105dzania dzia\u0142aj\u0105cymi serverami SAS oraz system plik\u00f3w po stronie serwera.\n</li></br>\n\n<li>\n<b>SAS Guide</b> Narz\u0119dzie kt\u00f3re jest u\u017cywane przeze mnie do bardziej zaawansowanych zada\u0144.\nW nim zazwyczaj tworze bardziej skomplikowane raporty u\u017cywaj\u0105c przy tym \n<b>SAS Macro Language/SAS Base programming language</b>. S\u0142u\u017cy r\u00f3wnie\u017c do bardziej zaawansowanego budowania\nkostek OLAP oraz ich modyfikacji.\n</li></br>\n\n<li>\n<b>SAS Olap Cube Studio</b> Narz\u0119dzie kt\u00f3re s\u0142u\u017cy g\u0142\u00f3wnie do projektowania i zarz\u0105dzania kostkami OLAP.\n</li></br>\n<li>\n<b>SAS Olap Map information studio and SAS Web Raport Studio</b>  Jako narz\u0119dzia kt\u00f3re s\u0105 ju\u017c bli\u017cej zwi\u0105zane\nz samym raportowaniem. Mapy informacyjne nak\u0142adane na kostk\u0119 s\u0142u\u017c\u0105 jako pewnego rodzaju \u017ar\u00f3d\u0142a danych dla tworzonych\nw WRS interaktywnych raport\u00f3w.\n</li></br>\n</ul>\n\n\n</li></br>\n\n\n\n<li>\nW tej chwili jako jeden z bardziej do\u015bwiadczonych developer\u00f3w jestem bardziej zwi\u0105zany z wprowadzaniem nowych koleg\u00f3w w \u015bwiat projektu\noraz zarz\u0105dzaniem przep\u0142ywu informacji pomi\u0119dzy zespo\u0142em developer\u00f3w a analizy kt\u00f3ry \nbezpo\u015brednio prezentuje klienta. </br>\n\n</li></br>\n\n<li>\nJako dodatkow\u0105 informacj\u0119 mog\u0119 wtr\u0105ci\u0107 m\u00f3j prywatny sukces w projekcie.\nZ zespo\u0142u kt\u00f3ry posiada powy\u017cej 10 developer\u00f3w zosta\u0142em wytypowany do zainstalowania\n(wraz z dobrym koleg\u0105 od spraw technicznych),przygotowania oraz prowadzenia test\u00f3w akceptacyjnych u klienta.\nOddawana by\u0142a cz\u0119\u015b\u0107 naszego projektu, sp\u0119dzi\u0142em tydzie\u0144 ci\u0119\u017cko pracuj\u0105c ale dzi\u0119ki zdalnemu wsparciu\nzespo\u0142u i determinacji uda\u0142o nam si\u0119 obroni\u0107 i usatysfakcjonowa\u0107 klienta.\n</li></br>\n\n</ul>
certM.jsf=Certyfikaty
cert1.jsf=Przez okres pracy w sygnity mia\u0142em okazje bra\u0107 udzia\u0142 w paru szkoleniach kt\u00f3re ko\u0144czy\u0142y si\u0119 certyfikatem.</br>\nSzkolenie EJB:</br>\nSzkolenie trawa\u0142o 2 dni. By\u0142o prowadzone zdalnie przez szkoleniowca Oracle. W ramach kursu zopsta\u0142y nam przedstawione podstawy dzia\u0142ania EJB co p\u00f3\u017aniej wykorzystywali\u015bmy do stworzenia prostej aplikacji wykorzystuj\u0105cej Java Message Service. W kontenerze EJB zosta\u0142 wystawiony bean kt\u00f3ry obs\u0142ugiwa\u0142 klient\u00f3w zewn\u0119trznych i zwraca\u0142 im aktualn\u0105 date.\nSzkolenia SAS:</br>\nBy\u0142y to szkolenia zwi\u0105zane z moim przej\u015bciem do projektu SAS. Ka\u017cde ze szkole\u0144 trwa\u0142o 2-3 dni, odbywa\u0142y si\u0119 w centrum SAS w Warszawie. Otrzymali\u015bmy soldine podstawy oraz poznali\u015bmy g\u0142\u00f3wne narz\u0119dzia platformy SAS kt\u00f3re u\u017cywamy w tej chwili.\n
codeM.jsf=Moja strona
codeMySite1.jsf=Strona powsta\u0142a przez to \u017ce bed\u0105c aktualnie zwi\u0105zany z projektem hurttowni danych coraz mniej w pracy mam do czynienia z je\u017cykiem java i technologiami webowymi.</br>\nZainteresowa\u0142em si\u0119 frameworkiem JSF gdy\u017c chcia\u0142em nauczy\u0107 si\u0119 w miare \u0142atwy spos\u00f3b oraz efektywnie budowa\u0107 aplikacje webowe za pomoc\u0105 javy.</br>\nNie ukrywam \u017ce bibliloteki primefaces bardzo wp\u0142yne\u0142y na kierunek nauki.</br>\nOczywi\u015bcie prosze mie\u0107 \u015bwiadomo\u015b\u0107 \u017ce jest to praca czysto hobbystyczna</br>\nKody \u017ar\u00f3d\u0142owe aplikacji s\u0105 og\u00f3lno dost\u0119pne do wgl\u0105du pod adresem:</br>
codeC.jsf=Sklep z autami
codeC1.jsf=Projekt "Warsztat samochodowy"  jest projektem kt\u00f3ry wykonywa\u0142em jako zlecenie.  </br>\nW zamierzeniach mia\u0142a by\u0107 to prosta plikacja CRUD kt\u00f3ra umozliwia\u0142a prowadzenie operacji na samochodach,</br>\nsymuluj\u0105c rejestr w warsztacie samochodowym. </br>\nUwzgl\u0119dnia przyjmowanie samochod\u00f3w przez pracownik\u00f3w kt\u00f3rzy wyceniaja naprawe oraz rejestruj\u0105ca stan prac. Za co p\u00f3\u017aniej maj\u0105 wyp\u0142acane nale\u017cne pieni\u0105dze. </br>\nTechnologie wykorzystane to SWING oraz JDBC.</br>\nKod aplikacji pod adresem:</br>
contactM.jsf=Kontakt
contact1.jsf=Telefon kontaktowy
contact2.jsf=Obecne miejsce zamieszkania
shop1.jsf=Docelowo bedzie sie tutaj znajdowa\u0142 opis jak i kod projektu sklepu z ksiazkami, kt\u00f3ry jaki\u015b czas temu ju\u017c go stworzy\u0142em na bazie JSF oraz JPA (EclipseLink).</br>\nDost\u0119pny jest pod adresem:</br>\n
shop2.jsf=Jednak ci\u0105gle jest to do\u015b\u0107 chaotyczny i niedporacowany projekt kt\u00f3ry przepisuje na dzia\u0142anie wraz z hibernate. W kolejnym czasie chcia\u0142bym go r\u00f3wnie\u017c zintegrowa\u0107 ze Springiem.
