main.jsf=G\u0142\u00f3wna
lang.jsf = J\u0119zyk
navi.jsf= Nawigacja
myInfo.jsf=O mnie
marekHoraczyInfo.jsf=Strona informacyjna Marka Horaczego
start.jsf=Cze\u015b\u0107! <br /> \nNazywam si\u0119 Marek Horaczy. Z zami\u0142ownia  jestem  programist\u0105 javy  kt\u00f3ry tworzy t\u0105 strone aby na\u015bwietli\u0107 moj\u0105 posta\u0107 potencjalnemu nowemu pracodawcy. <br />\nZ technicznego punktu widzenia strona ta zbudowana jest poprzez framework Java Server Faces wraz z nak\u0142\u0105dk\u0105 graficzn\u0105 Prime Faces.  Ca\u0142o\u015b\u0107 jest wystawiona  poprzez hosting zapewniony przez https://www.openshift.com. <br />\nZapraszam do przegl\u0105dniecia szczeg\u00f3\u0142owych informacji o mnie, kr\u00f3tkich opis\u00f3w projekt\u00f3w w kt\u00f3rych pracowa\u0142em/pracuje czy pozosta\u0142ych aplikacji kt\u00f3re r\u00f3wnie\u017c tworze w wolnym czasie. 
startH.jsf=O stronie
uzH.jsf=Uniwersytet Zielonog\u00f3rski
uzInfo1.jsf=Studia wy\u017csze uko\u0144czy\u0142am na wydziale matematyki informatyki i ekonometrii w Zielonej G\u00f3rze.<br/>
uzInfo2.jsf=Czas studi\u00f3w mo\u017cna by by\u0142o stre\u015bci\u0107 jedn\u0105 z moich starych notatek.<br/>
uzInfo3.jsf=Mimo \u017ce wi\u0119kszo\u015b\u0107 przedmiot\u00f3w by\u0142a powi\u0105zana bezpo\u015brednio z matematyka oraz przedmiotami z ni\u0105 powi\u0105zanymi, pojawi\u0142o si\u0119 pare przedmiot\u00f3w zwi\u0105zanych z programowaniem i bazami danych. Mimo \u017ce nie by\u0142o ich wiele, zaszepi\u0142y we mnie fascynacj\u0119 programowania kt\u00f3r\u0105 ju\u017c sam z determinacj\u0105 stara\u0142em si\u0119 rozwija\u0107.
work1.jsf=Po uko\u0144czeniu studi\u00f3w uda\u0142o mi si\u0119 dosta\u0107 na praktyki do lokalnej firmy Max Elektronik w kt\u00f3rej zreszt\u0105 pracuje do dzi\u015b. Trafi\u0142em do zespo\u0142u specjalist\u00f3w w kt\u00f3rym otrzymywa\u0142em przez pierwsze 3 misi\u0105ce r\u00f3\u017cne zadania zwi\u0105zane \u015bci\u015ble z je\u017ceykiem java. Zaczynaj\u0105c od test\u00f3w jednostkowych metod po stronie serwera za pomoc\u0105 JUNIT przez przepisywanie cz\u0119\u015b\u0107 starszego projektu z j\u0119zyka c++ na jave dochodz\u0105\u0107 do samodzielnego pisania serwis\u00f3w w springu kt\u00f3re te\u017c p\u00f3\u017aniej testowa\u0142em poprzez aplikacje SOAPUI. Szef widz\u0105c moje zaanga\u017cowanie postanowi\u0142 przydzieli\u0107 mnie do 'zespo\u0142u ratunkowego' kt\u00f3ry mia\u0142 wesprze\u0107 projekt koleg\u00f3w z warszawy, oparty na smartGWT, hibernate oraz springu. W nim sp\u0119dzi\u0142em bardzo owocny rok, programuj\u0105c.
workH.jsf=Pocz\u0105tek pracy oraz Java w Max Elektronik
sasH.jsf=Nowy projekt, platforma SAS oraz hurtownie danych
sas1.jsf=Po udanej "akcji ratunkowej" projektu POBYT, zosta\u0142\u0119m przyj\u0119ty do firmy na sta\u0142e.Otrzyma\u0142em umowe na czas nieokre\u015blony oraz status  pe\u0142noprawnego pracownika. Z\u0142o\u017cy\u0142o si\u0119 tak \u017ce by\u0142 chwilowy zast\u00f3j w\u015br\u00f3d projekt\u00f3w javy a nowo otwarta kom\u00f3rka hurtowni danych potrzebowa\u0142a \u015bwierzych os\u00f3b do jednego z wi\u0119kszych projekt\u00f3w jakie nasze firma mia\u0142a okazje robi\u0107. W ten spos\u00f3b trafi\u0142em do projektu opartego na platformie SAS. Do kt\u00f3rej nale\u017ce i w kt\u00f3rej pracuj\u0119 w do tej chwili.
